import telebot
from datetime import *

def Program(today):
    week = WeekLooker(today)
    day = today.strftime('%A')
    day = coverterDAYtoNUM(day)

    if week == 1:



        if day == 1:
            if today < datetime(2022, 2, 21) or today > datetime(2022, 4, 24):
                return "Понедельник, нечетная неделя.\n1 - 9:30-11:05, дистант, лекция по Философии;\n2 - 11:20-12:55, дистант, Английский язык;\n3 - Пары нет;\n4 - Пары нет;\n5 - Пары нет."
            else:
                return "Понедельник, нечетная неделя.\n1 - 9:30-11:05, дистант, лекция по Философии;\n2 - 11:20-12:55, дистант, Английский язык;\n3 - 13:10-14:45, дистант, пратика по ВИТ;\n4 - Пары нет;\n5 - Пары нет."
        


        elif day == 2:
            if today > datetime(2022, 4, 3):
                return "Вторник, нечетная неделя.\n1 - Пары нет;\n2 - Пары нет;\n3 - 13:10-14:45, дистант, пратика Математики;\n4 - 15:25-17:00, дистант, пратика Философии;\n5 - Пары нет."
            else:
                return "Вторник, нечетная неделя.\n1 - Пары нет;\n2 - 11:20-12:55, дистант, лекция по Физике;\n3 - 13:10-14:45, дистант, пратика Математики;\n4 - 15:25-17:00, дистант, пратика Философии;\n5 - Пары нет."
        


        elif day == 3:
            if today < datetime(2022, 2, 21):
                return "Среда, нечетная неделя.\n1 - Пары нет;\n2 - 11:20-12:55, дистант, пратика Математики;\n3 - 13:10-14:45, дистант, пратика ТОЭ;\n4 - Пары нет;\n5 - Пары нет."
            elif today > datetime(2022, 2, 21) and today < datetime(2022, 5, 2):
                return "Среда, нечетная неделя.\n1 - Пары нет;\n2 - 11:20-12:55, дистант, пратика Математики;\n3 - 13:10-14:45, дистант, пратика ТОЭ;\n4 - 15:25-17:00, дистант, пратика ВИТ;\n5 - Пары нет."
            elif today > datetime(2022, 2, 21) and today > datetime(2022, 5, 2) and today < datetime(2022, 5, 15):
                return "Среда, нечетная неделя.\n1 - Пары нет;\n2 - Пары нет;\n3 - 13:10-14:45, дистант, пратика ТОЭ;\n4 - 15:25-17:00, дистант, пратика ВИТ;\n5 - Пары нет."
            elif today > datetime(2022, 2, 21) and today > datetime(2022, 5, 2) and today > datetime(2022, 5, 15) and today < datetime(2022, 5, 22):
                return "Среда, нечетная неделя.\n1 - Пары нет;\n2 - Пары нет;\n3 - Пары нет;\n4 - 15:25-17:00, дистант, пратика ВИТ;\n5 - Пары нет."
            else:
                return "Среда, нечетная неделя.\n1 - Пары нет;\n2 - Пары нет;\n3 - Пары нет;\n4 - Пары нет;\n5 - Пары нет."
        


        elif day == 4:
            if today < datetime(2022, 3, 14):
                return "Четверг, нечетная неделя.\n1 - Пары нет;\n2 - Пары нет;\n3 - Пары нет;\n4 - Пары нет;\n5 - Пары нет."
            elif today > datetime(2022, 3, 14) and today < datetime(2022, 4, 4):
                return "Четверг, нечетная неделя.\n1 - Пары нет;\n2 - Пары нет;\n3 - Пары нет;\n4 - Пары нет;\n5 - 17:15-18:50, очно, лабы по ТОЭ."
            elif today > datetime(2022, 3, 14) and today > datetime(2022, 4, 4) and today < datetime(2022, 5, 29):
                return "Четверг, нечетная неделя.\n1 - Пары нет;\n2 - 11:20-12:55, очно, лабы по Физике;\n3 - 13:10-14:45, очно, лабы по ИиКГ;\n4 - Пары нет;\n5 - 17:15-18:50, очно, лабы по ТОЭ."
            else:
                return "Четверг, нечетная неделя.\n1 - Пары нет;\n2 - 11:20-12:55, очно, лабы по Физике;\n3 - Пары нет;\n4 - Пары нет;\n5 - 17:15-18:50, очно, лабы по ТОЭ."
        


        elif day == 5:
            if today < datetime(2022, 4, 3):
                return "Пятница, нечетная неделя.\n1 - Пары нет;\n2 - 11:20-12:55, дистант, лекция по ИиКГ;\n3 - 13:10-14:45, дистант, лекция по ТОЭ;\n4 - 15:25-17:00, дистант, лекция по Математике;\n5 - 17:15-18:50, дистант, лекция по Социологии."
            elif today > datetime(2022, 4, 3) and today < datetime(2022, 5, 1):
                return "Пятница, нечетная неделя.\n1 - Пары нет;\n2 - Пары нет;\n3 - Пары нет;\n4 - 15:25-17:00, дистант, лекция по Математике;\n5 - 17:15-18:50, дистант, лекция по Социологии."
            else:
                return "Пятница, нечетная неделя.\n1 - Пары нет;\n2 - Пары нет;\n3 - Пары нет;\n4 - 15:25-17:00, дистант, лекция по Математике;\n5 - Пары нет."
        


        elif day == 6:
            if today < datetime(2022, 4, 28):
                return "Суббота, нечетная неделя.\n1 - Пары нет;\n2 - 11:20-12:55, дистант, Физ-ра;\n3 - 13:10-14:45, дистант, Физ-ра;\n4 - Пары нет;\n5 - Пары нет."
            else:
                return "Суббота, нечетная неделя.\n1 - Пары нет;\n2 - 11:20-12:55, дистант, Физ-ра;\n3 - 13:10-14:45, дистант, Физ-ра;\n4 - 15:25-17:00, дистант, пратика по Социологии;\n5 - Пары нет."
        

        elif day == 7:
            return "Ха-ха. Забавно. Это же воскресенье."



        else:
            return "Ошибка. Скинь деняг, пж, со степухи слетел((("



    elif week == 2:
        


        if day == 1:
            if today < datetime(2022, 2, 21):
                return "Понедельник, четная неделя.\n1 - Пары нет;\n2 - 11:20-12:55, дистант, Английский язык;\n3 - Пары нет;\n4 - Пары нет;\n5 - Пары нет."
            elif today > datetime(2022, 2, 21) and today < datetime(2022, 4, 24):
                return "Понедельник, четная неделя.\n1 - 9:30-11:05, дистант, практика по Физике;\n2 - 11:20-12:55, дистант, Английский язык;\n3 - 13:10-14:45, дистант, пратика по ВИТ;\n4 - Пары нет;\n5 - Пары нет."
            else:
                return "Понедельник, четная неделя.\n1 - 9:30-11:05, дистант, практика по Физике;\n2 - 11:20-12:55, дистант, Английский язык;\n3 - Пары нет;\n4 - Пары нет;\n5 - Пары нет."



        elif day == 2:
            if today > datetime(2022, 4, 3):
                return "Вторник, четная неделя.\n1 - Пары нет;\n2 - Пары нет;\n3 - 13:10-14:45, дистант, пратика Математики;\n4 - 15:25-17:00, дистант, пратика Философии;\n5 - Пары нет."
            else:
                return "Вторник, четная неделя.\n1 - Пары нет;\n2 - 11:20-12:55, дистант, лекция по Физике;\n3 - 13:10-14:45, дистант, пратика Математики;\n4 - 15:25-17:00, дистант, пратика Философии;\n5 - Пары нет."
        


        elif day == 3:
            if today < datetime(2022, 2, 21):
                return "Среда, четная неделя.\n1 - Пары нет;\n2 - 11:20-12:55, дистант, пратика Математики;\n3 - 13:10-14:45, дистант, пратика ТОЭ;\n4 - Пары нет;\n5 - Пары нет."
            elif today > datetime(2022, 2, 21) and today < datetime(2022, 5, 2):
                return "Среда, четная неделя.\n1 - Пары нет;\n2 - 11:20-12:55, дистант, пратика Математики;\n3 - 13:10-14:45, дистант, пратика ТОЭ;\n4 - 15:25-17:00, дистант, пратика ВИТ;\n5 - Пары нет."
            elif today > datetime(2022, 2, 21) and today > datetime(2022, 5, 2) and today < datetime(2022, 5, 15):
                return "Среда, четная неделя.\n1 - Пары нет;\n2 - Пары нет;\n3 - 13:10-14:45, дистант, пратика ТОЭ;\n4 - 15:25-17:00, дистант, пратика ВИТ;\n5 - Пары нет."
            elif today > datetime(2022, 2, 21) and today > datetime(2022, 5, 2) and today > datetime(2022, 5, 15) and today < datetime(2022, 5, 22):
                return "Среда, четная неделя.\n1 - Пары нет;\n2 - Пары нет;\n3 - Пары нет;\n4 - 15:25-17:00, дистант, пратика ВИТ;\n5 - Пары нет."
            else:
                return "Среда, четная неделя.\n1 - Пары нет;\n2 - Пары нет;\n3 - Пары нет;\n4 - Пары нет;\n5 - Пары нет."
        


        elif day == 4:
            if today < datetime(2022, 3, 14):
                return "Четверг, четная неделя.\n1 - Пары нет;\n2 - Пары нет;\n3 - Пары нет;\n4 - Пары нет;\n5 - Пары нет."
            elif today > datetime(2022, 3, 14) and today < datetime(2022, 4, 4):
                return "Четверг, четная неделя.\n1 - Пары нет;\n2 - Пары нет;\n3 - Пары нет;\n4 - Пары нет;\n5 - 17:15-18:50, очно, лабы по ТОЭ."
            elif today > datetime(2022, 3, 14) and today > datetime(2022, 4, 4) and today < datetime(2022, 5, 29):
                return "Четверг, четная неделя.\n1 - Пары нет;\n2 - 11:20-12:55, очно, лабы по Физике;\n3 - 13:10-14:45, очно, лабы по ИиКГ;\n4 - Пары нет;\n5 - 17:15-18:50, очно, лабы по ТОЭ."
            else:
                return "Четверг, четная неделя.\n1 - Пары нет;\n2 - 11:20-12:55, очно, лабы по Физике;\n3 - Пары нет;\n4 - Пары нет;\n5 - 17:15-18:50, очно, лабы по ТОЭ."
        


        elif day == 5:
            if today < datetime(2022, 4, 3):
                return "Пятница, четная неделя.\n1 - Пары нет;\n2 - Пары нет;\n3 - 13:10-14:45, дистант, лекция по ТОЭ;\n4 - 15:25-17:00, дистант, лекция по Математике;\n5 - 17:15-18:50, дистант, лекция по Социологии."
            elif today > datetime(2022, 4, 3) and today < datetime(2022, 5, 1):
                return "Пятница, четная неделя.\n1 - Пары нет;\n2 - Пары нет;\n3 - Пары нет;\n4 - 15:25-17:00, дистант, лекция по Математике;\n5 - 17:15-18:50, дистант, лекция по Социологии."
            else:
                return "Пятница, четная неделя.\n1 - Пары нет;\n2 - Пары нет;\n3 - Пары нет;\n4 - 15:25-17:00, дистант, лекция по Математике;\n5 - Пары нет."
        


        elif day == 6:
            if today < datetime(2022, 4, 28):
                return "Суббота, четная неделя.\n1 - Пары нет;\n2 - 11:20-12:55, дистант, Физ-ра;\n3 - 13:10-14:45, дистант, Физ-ра;\n4 - Пары нет;\n5 - Пары нет."
            else:
                return "Суббота, четная неделя.\n1 - Пары нет;\n2 - 11:20-12:55, дистант, Физ-ра;\n3 - 13:10-14:45, дистант, Физ-ра;\n4 - 15:25-17:00, дистант, пратика по Социологии;\n5 - Пары нет."
        

        elif day == 7:
            return "Ха-ха. Забавно. Это же воскресенье."



        else:
            return "Ошибка. Скинь деняг, пж, со степухи слетел((("

def WeekLooker(today):
    while today > datetime(2022, 2, 14):
        today -= timedelta(weeks = 2)
    if today > datetime(2022, 2, 7):
        return 2
    else:
        return 1

def coverterDAYtoNUM(today):
        if today == "Monday":
            return 1
        elif today == 'Tuesday':
            return 2
        elif today == 'Wednesday':
            return 3
        elif today == 'Thursday':
            return 4
        elif today == 'Friday':
            return 5
        elif today == 'Saturday':
            return 6
        elif today == 'Sunday':
            return 7

bot = telebot.TeleBot('5193669675:AAEjyKGLD_jnyYeOJBfeTlLVxvGreu3vitM')

@bot.message_handler(commands=["start"])
def start(m, res = False):
    bot.send_message(m.chat.id, 'Да, я тут. Напиши \"Сегодня\" или \"Завтра\".')

@bot.message_handler(content_types=["text"])
def handle_text(message):
    print('опа')
    if message.text == "Сегодня":
        today = datetime.now()
        bot.send_message(message.chat.id, Program(today))
    elif message.text == "Завтра":
        today = datetime.now()
        today += timedelta(days=1)
        bot.send_message(message.chat.id, Program(today))
    else:
        bot.send_message(message.chat.id, "Не понял.")
bot.polling(none_stop=True, interval=0)