from datetime import *
import requests
from telebot import *

bot = telebot.TeleBot('5193669675:AAEjyKGLD_jnyYeOJBfeTlLVxvGreu3vitM')
key = '28b81a31ff024511211cc73d800c084c'
city = 'Moscow,RU'

def WeatherBot():#делает запрос на сайт с данными и возвращает их
    res = requests.get("http://api.openweathermap.org/data/2.5/weather",params={'q':city,'units':'metric','lang':'ru','APPID':key})
    data = res.json()
    return("Город: "+str(city[0:6])+"\nПогодные условия: "+str(data['weather'][0]['description'])+"\nТемпература: "+str(data['main']['temp']))

def Program(today):#По сути, это просто расписание, которое можно было перевести в базу данных
    week = WeekLooker(today)
    day = today.strftime('%A')
    day = coverterDAYtoNUM(day)

    if week == 1:

        if day == 1:
            if today < datetime(2022, 2, 21) or today > datetime(2022, 4, 24):
                return "Понедельник, нечетная неделя.\n1 - 9:30-11:05, дистант, лекция по Философии;\n2 - 11:20-12:55, дистант, Английский язык;\n3 - Пары нет;\n4 - Пары нет;\n5 - Пары нет."
            else:
                return "Понедельник, нечетная неделя.\n1 - 9:30-11:05, дистант, лекция по Философии;\n2 - 11:20-12:55, дистант, Английский язык;\n3 - 13:10-14:45, дистант, пратика по ВвИТ;\n4 - Пары нет;\n5 - Пары нет."

        elif day == 2:
            if today > datetime(2022, 4, 3):
                return "Вторник, нечетная неделя.\n1 - Пары нет;\n2 - Пары нет;\n3 - 13:10-14:45, дистант, пратика Математики;\n4 - 15:25-17:00, дистант, пратика Философии;\n5 - Пары нет."
            else:
                return "Вторник, нечетная неделя.\n1 - Пары нет;\n2 - 11:20-12:55, дистант, лекция по Физике;\n3 - 13:10-14:45, дистант, пратика Математики;\n4 - 15:25-17:00, дистант, пратика Философии;\n5 - Пары нет."

        elif day == 3:
            if today < datetime(2022, 2, 21):
                return "Среда, нечетная неделя.\n1 - Пары нет;\n2 - 11:20-12:55, дистант, пратика Математики;\n3 - 13:10-14:45, дистант, пратика ТОЭ;\n4 - Пары нет;\n5 - Пары нет."
            elif today > datetime(2022, 2, 21) and today < datetime(2022, 5, 2):
                return "Среда, нечетная неделя.\n1 - Пары нет;\n2 - 11:20-12:55, дистант, пратика Математики;\n3 - 13:10-14:45, дистант, пратика ТОЭ;\n4 - 15:25-17:00, дистант, пратика ВвИТ;\n5 - Пары нет."
            elif today > datetime(2022, 2, 21) and today > datetime(2022, 5, 2) and today < datetime(2022, 5, 15):
                return "Среда, нечетная неделя.\n1 - Пары нет;\n2 - Пары нет;\n3 - 13:10-14:45, дистант, пратика ТОЭ;\n4 - 15:25-17:00, дистант, пратика ВвИТ;\n5 - Пары нет."
            elif today > datetime(2022, 2, 21) and today > datetime(2022, 5, 2) and today > datetime(2022, 5, 15) and today < datetime(2022, 5, 22):
                return "Среда, нечетная неделя.\n1 - Пары нет;\n2 - Пары нет;\n3 - Пары нет;\n4 - 15:25-17:00, дистант, пратика ВвИТ;\n5 - Пары нет."
            else:
                return "Среда, нечетная неделя.\n1 - Пары нет;\n2 - Пары нет;\n3 - Пары нет;\n4 - Пары нет;\n5 - Пары нет."

        elif day == 4:
            if today < datetime(2022, 3, 14):
                return "Четверг, нечетная неделя.\n1 - Пары нет;\n2 - Пары нет;\n3 - Пары нет;\n4 - Пары нет;\n5 - Пары нет."
            elif today > datetime(2022, 3, 14) and today < datetime(2022, 4, 4):
                return "Четверг, нечетная неделя.\n1 - Пары нет;\n2 - Пары нет;\n3 - Пары нет;\n4 - Пары нет;\n5 - 17:15-18:50, очно, лабы по ТОЭ."
            elif today > datetime(2022, 3, 14) and today > datetime(2022, 4, 4) and today < datetime(2022, 5, 29):
                return "Четверг, нечетная неделя.\n1 - Пары нет;\n2 - 11:20-12:55, очно, лабы по Физике;\n3 - 13:10-14:45, очно, лабы по ИиКГ;\n4 - Пары нет;\n5 - 17:15-18:50, очно, лабы по ТОЭ."
            else:
                return "Четверг, нечетная неделя.\n1 - Пары нет;\n2 - 11:20-12:55, очно, лабы по Физике;\n3 - Пары нет;\n4 - Пары нет;\n5 - 17:15-18:50, очно, лабы по ТОЭ."

        elif day == 5:
            if today < datetime(2022, 4, 3):
                return "Пятница, нечетная неделя.\n1 - Пары нет;\n2 - 11:20-12:55, дистант, лекция по ИиКГ;\n3 - 13:10-14:45, дистант, лекция по ТОЭ;\n4 - 15:25-17:00, дистант, лекция по Математике;\n5 - 17:15-18:50, дистант, лекция по Социологии."
            elif today > datetime(2022, 4, 3) and today < datetime(2022, 5, 1):
                return "Пятница, нечетная неделя.\n1 - Пары нет;\n2 - Пары нет;\n3 - Пары нет;\n4 - 15:25-17:00, дистант, лекция по Математике;\n5 - 17:15-18:50, дистант, лекция по Социологии."
            else:
                return "Пятница, нечетная неделя.\n1 - Пары нет;\n2 - Пары нет;\n3 - Пары нет;\n4 - 15:25-17:00, дистант, лекция по Математике;\n5 - Пары нет."

        elif day == 6:
            if today < datetime(2022, 4, 28):
                return "Суббота, нечетная неделя.\n1 - Пары нет;\n2 - 11:20-12:55, дистант, Физ-ра;\n3 - 13:10-14:45, дистант, Физ-ра;\n4 - Пары нет;\n5 - 17:15-18:50, дистант, лабы по ВвИТ."
            else:
                return "Суббота, нечетная неделя.\n1 - Пары нет;\n2 - 11:20-12:55, дистант, Физ-ра;\n3 - 13:10-14:45, дистант, Физ-ра;\n4 - 15:25-17:00, дистант, пратика по Социологии;\n5 - 17:15-18:50, дистант, лабы по ВвИТ."

        elif day == 7:
            return "Ха-ха. Забавно. Это же воскресенье."

        else:
            return "Ошибка. Скинь деняг, пж, со степухи слетел((("


    elif week == 2:

        if day == 1:
            if today < datetime(2022, 2, 21):
                return "Понедельник, четная неделя.\n1 - Пары нет;\n2 - 11:20-12:55, дистант, Английский язык;\n3 - Пары нет;\n4 - Пары нет;\n5 - Пары нет."
            elif today > datetime(2022, 2, 21) and today < datetime(2022, 4, 24):
                return "Понедельник, четная неделя.\n1 - 9:30-11:05, дистант, практика по Физике;\n2 - 11:20-12:55, дистант, Английский язык;\n3 - 13:10-14:45, дистант, пратика по ВвИТ;\n4 - Пары нет;\n5 - Пары нет."
            else:
                return "Понедельник, четная неделя.\n1 - 9:30-11:05, дистант, практика по Физике;\n2 - 11:20-12:55, дистант, Английский язык;\n3 - Пары нет;\n4 - Пары нет;\n5 - Пары нет."

        elif day == 2:
            if today > datetime(2022, 4, 3):
                return "Вторник, четная неделя.\n1 - Пары нет;\n2 - Пары нет;\n3 - 13:10-14:45, дистант, пратика Математики;\n4 - 15:25-17:00, дистант, пратика Философии;\n5 - Пары нет."
            else:
                return "Вторник, четная неделя.\n1 - Пары нет;\n2 - 11:20-12:55, дистант, лекция по Физике;\n3 - 13:10-14:45, дистант, пратика Математики;\n4 - 15:25-17:00, дистант, пратика Философии;\n5 - Пары нет."

        elif day == 3:
            if today < datetime(2022, 2, 21):
                return "Среда, четная неделя.\n1 - Пары нет;\n2 - 11:20-12:55, дистант, пратика Математики;\n3 - 13:10-14:45, дистант, пратика ТОЭ;\n4 - Пары нет;\n5 - Пары нет."
            elif today > datetime(2022, 2, 21) and today < datetime(2022, 5, 2):
                return "Среда, четная неделя.\n1 - Пары нет;\n2 - 11:20-12:55, дистант, пратика Математики;\n3 - 13:10-14:45, дистант, пратика ТОЭ;\n4 - 15:25-17:00, дистант, пратика ВвИТ;\n5 - Пары нет."
            elif today > datetime(2022, 2, 21) and today > datetime(2022, 5, 2) and today < datetime(2022, 5, 15):
                return "Среда, четная неделя.\n1 - Пары нет;\n2 - Пары нет;\n3 - 13:10-14:45, дистант, пратика ТОЭ;\n4 - 15:25-17:00, дистант, пратика ВвИТ;\n5 - Пары нет."
            elif today > datetime(2022, 2, 21) and today > datetime(2022, 5, 2) and today > datetime(2022, 5, 15) and today < datetime(2022, 5, 22):
                return "Среда, четная неделя.\n1 - Пары нет;\n2 - Пары нет;\n3 - Пары нет;\n4 - 15:25-17:00, дистант, пратика ВвИТ;\n5 - Пары нет."
            else:
                return "Среда, четная неделя.\n1 - Пары нет;\n2 - Пары нет;\n3 - Пары нет;\n4 - Пары нет;\n5 - Пары нет."

        elif day == 4:
            if today < datetime(2022, 3, 14):
                return "Четверг, четная неделя.\n1 - Пары нет;\n2 - Пары нет;\n3 - Пары нет;\n4 - Пары нет;\n5 - Пары нет."
            elif today > datetime(2022, 3, 14) and today < datetime(2022, 4, 4):
                return "Четверг, четная неделя.\n1 - Пары нет;\n2 - Пары нет;\n3 - Пары нет;\n4 - Пары нет;\n5 - 17:15-18:50, очно, лабы по ТОЭ."
            elif today > datetime(2022, 3, 14) and today > datetime(2022, 4, 4) and today < datetime(2022, 5, 29):
                return "Четверг, четная неделя.\n1 - Пары нет;\n2 - 11:20-12:55, очно, лабы по Физике;\n3 - 13:10-14:45, очно, лабы по ИиКГ;\n4 - Пары нет;\n5 - 17:15-18:50, очно, лабы по ТОЭ."
            else:
                return "Четверг, четная неделя.\n1 - Пары нет;\n2 - 11:20-12:55, очно, лабы по Физике;\n3 - Пары нет;\n4 - Пары нет;\n5 - 17:15-18:50, очно, лабы по ТОЭ."

        elif day == 5:
            if today < datetime(2022, 4, 3):
                return "Пятница, четная неделя.\n1 - Пары нет;\n2 - Пары нет;\n3 - 13:10-14:45, дистант, лекция по ТОЭ;\n4 - 15:25-17:00, дистант, лекция по Математике;\n5 - 17:15-18:50, дистант, лекция по Социологии."
            elif today > datetime(2022, 4, 3) and today < datetime(2022, 5, 1):
                return "Пятница, четная неделя.\n1 - Пары нет;\n2 - Пары нет;\n3 - Пары нет;\n4 - 15:25-17:00, дистант, лекция по Математике;\n5 - 17:15-18:50, дистант, лекция по Социологии."
            else:
                return "Пятница, четная неделя.\n1 - Пары нет;\n2 - Пары нет;\n3 - Пары нет;\n4 - 15:25-17:00, дистант, лекция по Математике;\n5 - Пары нет."

        elif day == 6:
            if today < datetime(2022, 4, 28):
                return "Суббота, четная неделя.\n1 - Пары нет;\n2 - 11:20-12:55, дистант, Физ-ра;\n3 - 13:10-14:45, дистант, Физ-ра;\n4 - Пары нет;\n5 - 17:15-18:50, дистант, лабы по ВвИТ."
            else:
                return "Суббота, четная неделя.\n1 - Пары нет;\n2 - 11:20-12:55, дистант, Физ-ра;\n3 - 13:10-14:45, дистант, Физ-ра;\n4 - 15:25-17:00, дистант, пратика по Социологии;\n5 - 17:15-18:50, дистант, лабы по ВвИТ."

        elif day == 7:
            return "Ха-ха. Забавно. Это же воскресенье."

        
        else:
            return "Ошибка. Скинь деняг, пж, со степухи слетел((("

def WeekLooker(today):#эта функция определяет четность недели
    while today > datetime(2022, 2, 14):
        today -= timedelta(weeks = 2)
    if today > datetime(2022, 2, 7):
        return 2
    else:
        return 1

def coverterDAYtoNUM(today):
        if today == "Monday":
            return 1
        elif today == 'Tuesday':
            return 2
        elif today == 'Wednesday':
            return 3
        elif today == 'Thursday':
            return 4
        elif today == 'Friday':
            return 5
        elif today == 'Saturday':
            return 6
        elif today == 'Sunday':
            return 7

@bot.message_handler(commands=["start"])
def start(m, res = False):
    markup = types.ReplyKeyboardMarkup(row_width=2, resize_keyboard=True)
    itembtn1 = types.KeyboardButton('Сегодня')
    itembtn2 = types.KeyboardButton('Завтра')
    itembtn3 = types.KeyboardButton('Погода')
    itembtn4 = types.KeyboardButton('/start')
    markup.add(itembtn1, itembtn2, itembtn3, itembtn4)
    bot.send_message(m.chat.id, text="Здравствуйте. Список доступных команд на данный момент:\n1)Расписание сегодня;\n2)Расписание завтра;\n3)Погода", reply_markup=markup)

@bot.message_handler(regexp="Погода")
def weather(message):
    bot.reply_to(message, WeatherBot())
@bot.message_handler(regexp="Сегодня")
def to_day(message):
    today = datetime.now()
    bot.reply_to(message, Program(today))
@bot.message_handler(regexp="Завтра")
def to_morrow(message):
    today = datetime.now()
    today += timedelta(days=1)
    bot.reply_to(message, Program(today))

bot.polling(none_stop=True, interval=0)
